hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/Libraries/inc/cw32l010_atim.h
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CW32L010_ATIM_H
#define __CW32L010_ATIM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "system_cw32l010.h"

/******************************************************************************
 * type definitions ('typedef')
 ******************************************************************************/
typedef struct
{
    FunctionalState BufferState;      /*!<  ARR缓存使能 */
    
    uint32_t CounterAlignedMode;      /*!< 计数对齐模式: 边沿或中央 */
    
    uint32_t CounterDirection;        /*!< 计数方向 */

    uint32_t CounterOPMode;           /*!< 运行模式：单次或重复 */    

    uint32_t Prescaler;               /*!< 预分频系数 */

    uint32_t ReloadValue;           /*!< ARR赋值，取值范围0x0000~0xFFFF */

    uint32_t RepetitionCounter;     /*!< 重复周期计数值，RCR寄存器 */

} ATIM_InitTypeDef;

typedef struct
{
    uint32_t OCPolarity;  /*!< 端口极性选择：正向、反向 */

    uint32_t OCMode;     /*!< 比较模式配置 */
    
    uint32_t OCFastMode;            /*!< 快速比较模式 */   

    FunctionalState OCInterruptState; /*!< 比较匹配触发中断使能状态 */

    FunctionalState BufferState;    /*!< 比较缓存使能状态 */
    
    FunctionalState OCComplement;   /*!< 比较互补输出 */
} ATIM_OCInitTypeDef;

typedef struct
{
    uint32_t ICMap;                /* IC映射 */
    
    uint32_t ICPrescaler;          /* 输入捕获预分配 */
    
    uint32_t ICFilter;             /*!< 输入滤波配置 */
    
    uint32_t ICPolarity;  /*!< 输入捕获极性：上升、下降、双沿 */

    
} ATIM_ICInitTypeDef;


/******************************************************************************
 * pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define ATIM_COUNTING_UP                       (0UL)
#define ATIM_COUNTING_DOWN                     (1UL << ATIM_CR1_DIR_Pos)
#define IS_ATIM_COUNTING_DIRECTION(DIR)        (((DIR) == ATIM_COUNTING_UP) || \
                                               ((DIR) == ATIM_COUNTING_DOWN))

#define ATIM_OP_MODE_SINGLE                    (1UL << ATIM_CR1_OPM_Pos)
#define ATIM_OP_MODE_REPETITIVE                (0UL)
#define IS_ATIM_OP_MODE(MODE)                  (((MODE) == ATIM_OP_MODE_SINGLE) || \
                                               ((MODE) == ATIM_OP_MODE_REPETITIVE))


#define ATIM_COUNT_ALIGN_MODE_EDGE             (0UL << ATIM_CR1_CMS_Pos)
#define ATIM_COUNT_ALIGN_MODE_CENTER_DOWN      (1UL << ATIM_CR1_CMS_Pos)
#define ATIM_COUNT_ALIGN_MODE_CENTER_UP        (2UL << ATIM_CR1_CMS_Pos)
#define ATIM_COUNT_ALIGN_MODE_CENTER_BOTH      (3UL << ATIM_CR1_CMS_Pos)
#define IS_ATIM_COUNT_MODE(MODE)               (((MODE) == ATIM_COUNT_ALIGN_MODE_EDGE) || \
                                                ((MODE) == ATIM_COUNT_ALIGN_MODE_CENTER_DOWN) || \
                                                ((MODE) == ATIM_COUNT_ALIGN_MODE_CENTER_UP) || \
                                                ((MODE) == ATIM_COUNT_ALIGN_MODE_CENTER_BOTH))

#define ATIM_IT_TERRIE                         (1UL << 23)
#define ATIM_IT_IERRIE                         (1UL << 22)
#define ATIM_IT_DIRIE                          (1UL << 21)
#define ATIM_IT_IDXIE                          (1UL << 20)
#define ATIM_IT_BIE                            (1UL << 7)
#define ATIM_IT_TIE                            (1UL << 6)
#define ATIM_IT_COMIE                          (1UL << 5)
#define ATIM_IT_CC4IE                          (1UL << 4)
#define ATIM_IT_CC3IE                          (1UL << 3)
#define ATIM_IT_CC2IE                          (1UL << 2)
#define ATIM_IT_CC1IE                          (1UL << 1)
#define ATIM_IT_UIE                            (1UL << 0)
#define IS_ATIM_IT(IT)                         (((IT) != 0) && (((IT) & 0x00F300FF) != 0))

#define	ATIM_STATE_CC6OF	        (1UL << 19)
#define	ATIM_STATE_CC5OF	        (1UL << 18)
#define	ATIM_STATE_CC6IF	        (1UL << 17)
#define	ATIM_STATE_CC5IF        	(1UL << 16)
#define	ATIM_STATE_SBIF	            (1UL << 13)
#define	ATIM_STATE_CC4OF	        (1UL << 12)
#define	ATIM_STATE_CC3OF	        (1UL << 11)
#define	ATIM_STATE_CC2OF	        (1UL << 10)
#define	ATIM_STATE_CC1OF	        (1UL << 9)
#define	ATIM_STATE_B2IF	            (1UL << 8)
#define	ATIM_STATE_BIF	            (1UL << 7)
#define	ATIM_STATE_TIF	            (1UL << 6)
#define	ATIM_STATE_COMIF	        (1UL << 5)
#define	ATIM_STATE_CC4IF	        (1UL << 4)
#define	ATIM_STATE_CC3IF	        (1UL << 3)
#define	ATIM_STATE_CC2IF	        (1UL << 2)
#define	ATIM_STATE_CC1IF	        (1UL << 1)
#define	ATIM_STATE_UIF	            (1UL << 0)
#define IS_ATIM_STATE(STATE)        (((STATE) != 0) && (((STATE) & 0x0F3FFF) != 0))       


#define ATIM_BUFFER_ENABLE                     (1UL << 7)
#define ATIM_BUFFER_DISABLE                    (0UL)

#define IS_ATIM_PRESCALER(PRESCALER)           ((PRESCALER) <= 0xFFFF)

#define ATIM_CLOCK_PCLK                        (0UL)
#define ATIM_CLOCK_ETR                         (1UL << 2)
#define IS_ATIM_CLOCK(CLK)                     (((CLK) == ATIM_CLOCK_PCLK) || \
                                               ((CLK) == ATIM_CLOCK_ETR))


#define ATIM_IC_MAP_TIx                        (0x01U)
#define ATIM_IC_MAP_TIy                        (0x02U)
#define ATIM_IC_MAP_TRC                        (0x03U)



#define ATIM_ICPOLOARITY_RISING                (0UL)
#define ATIM_ICPOLOARITY_FALLING               (1UL)
#define ATIM_ICPOLARITY_BOTHEDGE               (3UL)
#define IS_ATIM_IC_POLARITY(POLARITY)          (((POLARITY) == ATIM_ICPOLOARITY_RISING) || \
                                                ((POLARITY) == ATIM_ICPOLOARITY_FALLING)|| \
                                                ((POLARITY) == ATIM_ICPOLARITY_BOTHEDGE))

