hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/Libraries/inc/cw32l010_atim.h
#define ATIM_ICFILTER_NONE                     (0UL)
#define ATIM_ICFILTER_PCLK_N2                  (1UL)
#define ATIM_ICFILTER_PCLK_N4                  (2UL)
#define ATIM_ICFILTER_PCLK_N8                  (3UL)
#define ATIM_ICFILTER_FCLKDIV2_N6              (4UL)
#define ATIM_ICFILTER_FCLKDIV2_N8              (5UL)
#define ATIM_ICFILTER_FCLKDIV4_N6              (6UL)
#define ATIM_ICFILTER_FCLKDIV4_N8              (7UL)
#define ATIM_ICFILTER_FCLKDIV8_N6              (8UL)
#define ATIM_ICFILTER_FCLKDIV8_N8              (9UL)
#define ATIM_ICFILTER_FCLKDIV16_N5             (10UL)
#define ATIM_ICFILTER_FCLKDIV16_N6             (11UL)
#define ATIM_ICFILTER_FCLKDIV16_N8             (12UL)
#define ATIM_ICFILTER_PCLKDIV32_N5             (13UL)
#define ATIM_ICFILTER_PCLKDIV32_N6             (14UL)
#define ATIM_ICFILTER_PCLKDIV32_N8             (15UL)
#define IS_ATIM_IC_FILTER(ICFILTER)            ((ICFILTER) <= 15UL)

#define ATIM_ICPRESCALER_DIV1                  0UL
#define ATIM_ICPRESCALER_DIV2                  1UL
#define ATIM_ICPRESCALER_DIV4                  2UL
#define ATIM_ICPRESCALER_DIV5                  3UL
#define IS_ATIMC_IC_PRESCALER(ICPERSCALER)     ((ICPERSCALER) < 4U)



#define ATIM_OCPOLARITY_NONINVERT              (0UL)
#define ATIM_OCPOLARITY_INVERT                 (1UL)
#define IS_ATIM_OC_POLARITY(POLARITY)          (((POLARITY) ==  ATIM_OCPOLARITY_NONINVERT) || \
                                               ((POLARITY) == ATIM_OCPOLARITY_INVERT))

#define ATIM_OCMODE_FROZEN                     (0UL)
#define ATIM_OCMODE_INACTIVE                   (1UL)
#define ATIM_OCMODE_ACTIVE                     (2UL)
#define ATIM_OCMODE_TOGGLE                     (3UL)
#define ATIM_OCMODE_FORCED_INACTIVE            (4UL)
#define ATIM_OCMODE_FORCED_ACTIVE              (5UL)
#define ATIM_OCMODE_PWM1                       (6UL)
#define ATIM_OCMODE_PWM2                       (7UL)
#define ATIM_OCMODE_ONE_PLUSE1                 (8UL)
#define ATIM_OCMODE_ONE_PLUSE2                 (9UL)
#define ATIM_OCMODE_PWM_GROUP1                 (0x0CUL)
#define ATIM_OCMODE_PWM_GROUP2                 (0x0DUL)
#define ATIM_OCMODE_PWM_ASYM1                  (0x0EUL)
#define ATIM_OCMODE_PWM_ASYM2                  (0x0FUL)
#define IS_ATIM_OC_MODE(MODE)                  ((MODE) <= 0x0FUL)


#define ATIM_OC_FAST_MODE_ENABLE               (1)
#define ATIM_OC_FAST_MODE_DISABLE              (0)
#define IS_ATIM_OC_FAST_MODE(MODE)             ((MODE) == ATIM_OC_FAST_MODE_ENABLE ||\
                                                (MODE) == ATIM_OC_FAST_MODE_DISABLE)

#define ATIM_OC_IT_NONE                        (0UL)
#define ATIM_OC_IT_UP_COUNTER                  (1UL)
#define ATIM_OC_IT_DOWN_COUNTER                (2UL)
#define ATIM_OC_IT_BOTH_COUNTER                (3UL)
#define IS_ATIM_OC_IT(SELECT)                  ((SELECT) <= 3UL)

#define ATIM_ETR_POLARITY_NONINVERT            (0UL)
#define ATIM_ETR_POLARITY_INVERT               (1UL << 31)
#define IS_ATIM_ETR_POLARITY(POLARITY)         (((POLARITY) == ATIM_ETR_POLARITY_INVERT) || \
                                               ((POLARITY) == ATIM_ETR_POLARITY_NONINVERT))

#define ATIM_ETR_FILTER_NONE                   (0UL)
#define ATIM_ETR_FILTER_PCLK_N3                (4UL << 28)
#define ATIM_ETR_FILTER_PCLKDIV4_N3            (5UL << 28)
#define ATIM_ETR_FILTER_PCLKDIV16_N3           (6UL << 28)
#define ATIM_ETR_FILTER_PCLKDIV64_N3           (7UL << 28)
#define IS_ATIM_ETR_FILTER(FILTER)             (((FILTER) == ATIM_ETR_FILTER_NONE) ||\
                                               ((FILTER) == ATIM_ETR_FILTER_PCLK_N3) || \
                                               ((FILTER) == ATIM_ETR_FILTER_PCLKDIV4_N3) || \
                                               ((FILTER) == ATIM_ETR_FILTER_PCLKDIV16_N3) || \
                                               ((FILTER) == ATIM_ETR_FILTER_PCLKDIV64_N3))

#define ATIM_BRAKE_POLARITY_LOW                (0UL)
#define ATIM_BRAKE_POLARITY_HIGH               (1UL)
#define IS_ATIM_BRAKE_POLARITY(POLARITY)       (((POLARITY) == ATIM_BRAKE_POLARITY_LOW) || \
                                               ((POLARITY) == ATIM_BRAKE_POLARITY_HIGH))

#define ATIM_BRAKE_FILTER_NONE                 (0UL)
#define ATIM_BRAKE_FILTER_PCLK_N2              (1UL)
#define ATIM_BRAKE_FILTER_PCLK_N4              (2UL)
#define ATIM_BRAKE_FILTER_PCLK_N8              (3UL)
#define ATIM_BRAKE_FILTER_FCLKDIV2_N6          (4UL)
#define ATIM_BRAKE_FILTER_FCLKDIV2_N8          (5UL)
#define ATIM_BRAKE_FILTER_FCLKDIV4_N6          (6UL)
#define ATIM_BRAKE_FILTER_FCLKDIV4_N8          (7UL)
#define ATIM_BRAKE_FILTER_FCLKDIV8_N6          (8UL)
#define ATIM_BRAKE_FILTER_FCLKDIV8_N8          (9UL)
#define ATIM_BRAKE_FILTER_FCLKDIV16_N5         (10UL)
#define ATIM_BRAKE_FILTER_FCLKDIV16_N6         (11UL)
#define ATIM_BRAKE_FILTER_FCLKDIV16_N8         (12UL)
#define ATIM_BRAKE_FILTER_PCLKDIV32_N5         (13UL)
#define ATIM_BRAKE_FILTER_PCLKDIV32_N6         (14UL)
#define ATIM_BRAKE_FILTER_PCLKDIV32_N8         (15UL)
#define IS_ATIM_BRAKE_FILTER(FILTER)           ((FILTER) <= 15UL)


#define ATIM_ADC_TRIGGER_GLOBAL                (1UL << 7)
#define ATIM_ADC_TRIGGER_CH3B                  (1UL << 6)
#define ATIM_ADC_TRIGGER_CH2B                  (1UL << 5)
#define ATIM_ADC_TRIGGER_CH1B                  (1UL << 4)
#define ATIM_ADC_TRIGGER_CH3A                  (1UL << 3)
#define ATIM_ADC_TRIGGER_CH2A                  (1UL << 2)
#define ATIM_ADC_TRIGGER_CH1A                  (1UL << 1)
#define ATIM_ADC_TRIGGER_UPDATA_EVENT          (1UL)
#define IS_ATIM_ADC_TRIGGER(SOURCE)            ((SOURCE) <= 0x000000FF)

#define OCREFA_TYPE_DOUBLE                     (0UL)
#define OCREFA_TYPE_SINGLE                     (1UL << 3)
#define IS_ATIM_OCREFA_TYPE(TYPE)              ((TYPE) == OCREFA_TYPE_DOUBLE || (TYPE) == OCREFA_TYPE_SINGLE)
#define OUTPUT_TYPE_ALONE                      (0UL)
#define OUTPUT_TYPE_COMP                       (1UL << 1)
#define IS_ATIM_OUTPUT_TYPE(TYPE)              ((TYPE) == OUTPUT_TYPE_ALONE || (TYPE) == OUTPUT_TYPE_COMP)
#define IS_ATIM_DEADTIME(VAL)                  ((VAL)<= 0xFF)

