hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/Libraries/inc/cw32l010_atim.h
#define ATIM_MASTER_OUTPUT_UG                  0x00    // 软件更新UG
#define ATIM_MASTER_OUTPUT_CTEN                0x01    // 定时器使能CTEN
#define ATIM_MASTER_OUTPUT_UEV                 0x02    // 定时器时间更新UEV
#define ATIM_MASTER_OUTPUT_ENCODE              0x03    // 编码器时钟输出
#define ATIM_MASTER_OUTPUT_CH1                 0x04    // CH1
#define ATIM_MASTER_OUTPUT_CH2                 0x05    // CH2
#define ATIM_MASTER_OUTPUT_CH3                 0x06    // CH3
#define ATIM_MASTER_OUTPUT_CH4                 0x07    // CH4
#define ATIM_MASTER_OUTPUT_CH5                 0x08    // CH5
#define ATIM_MASTER_OUTPUT_CH6                 0x09    // CH6
#define ATIM_MASTER_OUTPUT_OC1REF              0x0A    // 定时器比较输出OC1REF
#define ATIM_MASTER_OUTPUT_OC2REF              0x0B    // 定时器比较输出OC2REF
#define ATIM_MASTER_OUTPUT_OC3REF              0x0C    // 定时器比较输出OC3REF
#define ATIM_MASTER_OUTPUT_OC4REF              0x0D    // 定时器比较输出OC4REF
#define ATIM_MASTER_OUTPUT_OC5REF              0x0E    // 定时器比较输出OC5REF
#define ATIM_MASTER_OUTPUT_OC6REF              0x0F    // 定时器比较输出OC6REF
#define ATIM_MASTER_OUTPUT_OC1REFC             0x10    // 定时器比较输出OC1REFC 
#define ATIM_MASTER_OUTPUT_OC2REFC             0x11    // 定时器比较输出OC2REFC 
#define ATIM_MASTER_OUTPUT_OC3REFC             0x12    // 定时器比较输出OC3REFC 
#define ATIM_MASTER_OUTPUT_OC4REFC             0x13    // 定时器比较输出OC4REFC 
#define ATIM_MASTER_OUTPUT_OC5REFC             0x14    // 定时器比较输出OC5REFC 
#define ATIM_MASTER_OUTPUT_OC6REFC             0x15    // 定时器比较输出OC6REFC 
#define ATIM_MASTER_OUTPUT_OC3REFC_EDGE        0x16    // 定时器比较输出OC3REFC上升沿或下降沿
#define ATIM_MASTER_OUTPUT_OC4REFC_EDGE        0x17    // 定时器比较输出OC4REFC上升沿或下降沿
#define ATIM_MASTER_OUTPUT_OC5REFC_EDGE        0x18    // 定时器比较输出OC5REFC上升沿或下降沿
#define ATIM_MASTER_OUTPUT_OC6REFC_EDGE        0x19    // 定时器比较输出OC5REFC上升沿或下降沿
#define ATIM_MASTER_OUTPUT_OC5REFC_RAISE       0x1A    // 定时器比较输出OC5REFC上升沿
#define ATIM_MASTER_OUTPUT_OC5REFC_FALL        0x1B    // 定时器比较输出OC5REFC下降沿
#define ATIM_MASTER_OUTPUT_OC6REFC_RAISE       0x1C    // 定时器比较输出OC6REFC上升沿
#define ATIM_MASTER_OUTPUT_OC6REFC_FALL        0x1D    // 定时器比较输出OC6REFC下降沿
#define ATIM_MASTER_OUTPUT_OC56REFC_RAISE      0x1E    // 定时器比较输出OC5REFC上升沿或OC6REFC上升沿
#define ATIM_MASTER_OUTPUT_OC56REFC_FALL       0x1F    // 定时器比较输出OC5REFC上升沿或OC6REFC下降沿


#define IS_ATIM_MASTER_OUTPUT(OUTPUT)          ((OUTPUT) <= 0x1F)

#define ATIM_SLAVER_TYPE_PCLK                  0x00    // 内部时钟
#define ATIM_SLAVER_TYPE_ENCODE1               0x01    // 正交编码计数模式1
#define ATIM_SLAVER_TYPE_ENCODE2               0x02    // 正交编码计数模式2
#define ATIM_SLAVER_TYPE_ENCODE3               0x03    // 正交编码计数模式3
#define ATIM_SLAVER_TYPE_RESET                 0x04    // 复位功能
#define ATIM_SLAVER_TYPE_GATE                  0x05    // 门控功能
#define ATIM_SLAVER_TYPE_TRIGGER               0x06    // 触发模式
#define ATIM_SLAVER_TYPE_EXT                   0x07    // 外部时钟
#define ATIM_SLAVER_TYPE_RESET_TRIGGER         0x08    // RESET+TRGI
#define ATIM_SLAVER_TYPE_RESET_GATE            0x09    // RESET+GATE
#define ATIM_SLAVER_TYPE_ENCODE2_CLOCK_DIR     0x0A    // 编码模式——时钟+方向，×2模式
#define ATIM_SLAVER_TYPE_ENCODE1_CLOCK_DIR     0x0B    // 编码模式——时钟+方向，×1模式
#define ATIM_SLAVER_TYPE_ENCODE2_FIX_DIR       0x0C    // 编码模式 定向时钟，×2模式
#define ATIM_SLAVER_TYPE_ENCODE1_FIX_DIR       0x0D    // 编码模式 定向时钟，×2模式
#define ATIM_SLAVER_TYPE_QUAD_ENCODE1          0x0E    // 正交编码模式——×1模式
#define ATIM_SLAVER_TYPE_QUAD_ENCODE2          0x0F    // 正交编码模式——×1模式

#define IS_ATIM_SLAVER_TYPE(TYPE)              ((TYPE) <= 0x07)

/** @defgroup ATIM_TS Trigger Selection
  * @{
  */
#define ATIM_TS_ITR0                         0x00000000U                                                     /*!< Internal Trigger 0 (ITR0) is used as trigger input */
#define ATIM_TS_ITR1                         (0x00000001UL << ATIM_SMCR_TS_Pos)                              /*!< Internal Trigger 1 (ITR1) is used as trigger input */
#define ATIM_TS_ITR2                         (0x00000002UL << ATIM_SMCR_TS_Pos)                              /*!< Internal Trigger 2 (ITR2) is used as trigger input */
#define ATIM_TS_ITR3                         (0x00000003UL << ATIM_SMCR_TS_Pos)                              /*!< Internal Trigger 3 (ITR3) is used as trigger input */
#define ATIM_TS_TI1F_ED                      (0x00000004UL << ATIM_SMCR_TS_Pos)                              /*!< TI1 Edge Detector (TI1F_ED) is used as trigger input */
#define ATIM_TS_TI1FP1                       (0x00000005UL << ATIM_SMCR_TS_Pos)                              /*!< Filtered Timer Input 1 (TI1FP1) is used as trigger input */
#define ATIM_TS_TI2FP2                       (0x00000006UL << ATIM_SMCR_TS_Pos)                              /*!< Filtered Timer Input 2 (TI12P2) is used as trigger input */
#define ATIM_TS_ETRF                         (0x00000007UL << ATIM_SMCR_TS_Pos)                              /*!< Filtered external Trigger (ETRF) is used as trigger input */
#define ATIM_TS_ITR4                         (0x1000000UL)                                                   /*!< Internal Trigger 4 (ITR4) is used as trigger input */
#define ATIM_TS_ITR5                         (ATIM_TS_ITR4 | ATIM_TS_ITR1)                                   /*!< Internal Trigger 5 (ITR5) is used as trigger input */
#define ATIM_TS_ITR6                         (ATIM_TS_ITR4 | ATIM_TS_ITR2)                                   /*!< Internal Trigger 6 (ITR6) is used as trigger input */
#define ATIM_TS_ITR7                         (ATIM_TS_ITR4 | ATIM_TS_ITR3)                                   /*!< Internal Trigger 7 (ITR7) is used as trigger input */
#define ATIM_TS_ITR8                         (ATIM_TS_ITR4 | ATIM_TS_ITR4)                                   /*!< Internal Trigger 8 (ITR8) is used as trigger input */
#define ATIM_TS_ITR9                         (ATIM_TS_ITR4 | ATIM_TS_ITR5)                                   /*!< Internal Trigger 9 (ITR9) is used as trigger input */
#define ATIM_TS_ITR10                        (ATIM_TS_ITR4 | ATIM_TS_ITR6)                                   /*!< Internal Trigger 10 (ITR10) is used as trigger input */
#define ATIM_TS_ITR11                        (ATIM_TS_ITR4 | ATIM_TS_ITR7)                                   /*!< Internal Trigger 11 (ITR11) is used as trigger input */
#define ATIM_TS_ITR12                        (ATIM_TS_ITR4 << 1)                                             /*!< Internal Trigger 12 (ITR12) is used as trigger input */
#define IS_ATIM_TRIGGER_INPUT(TS)            ((TS == ATIM_TS_ITR0) ||\
                                              (TS == ATIM_TS_ITR1) ||\
                                              (TS == ATIM_TS_ITR2) ||\
                                              (TS == ATIM_TS_ITR3) ||\
                                              (TS == ATIM_TS_ITR4) ||\
                                              (TS == ATIM_TS_ITR5) ||\
                                              (TS == ATIM_TS_ITR6) ||\
                                              (TS == ATIM_TS_ITR7) ||\
                                              (TS == ATIM_TS_ITR8) ||\
                                              (TS == ATIM_TS_ITR9) ||\
                                              (TS == ATIM_TS_ITR10) ||\
                                              (TS == ATIM_TS_ITR11) ||\
                                              (TS == ATIM_TS_ITR12) ||\
                                              (TS == ATIM_TS_TI1F_ED) ||\
                                              (TS == ATIM_TS_TI1FP1) ||\
                                              (TS == ATIM_TS_TI2FP2) ||\
                                              (TS == ATIM_TS_ETRF))

#define ATIM_TRIGGER_SOURCE_ETFP               0x00  // 端口ETR的滤波相位选择后的信号ETFP
#define ATIM_TRIGGER_SOURCE_ITR                0x01  // 内部互联信号ITR
#define ATIM_TRIGGER_SOURCE_CH1A               0x05  // 端口CH1A的边沿信号
#define ATIM_TRIGGER_SOURCE_IAFP               0x06  // 端口CH1A的滤波相位选择后的信号IAFP
#define ATIM_TRIGGER_SOURCE_IBFP               0x07  // 端口CH1B的滤波相位选择后的信号IBFP
#define IS_ATIM_TRIGGER_SOURCE(SRC)            ((SRC) == ATIM_TRIGGER_SOURCE_ETFP || \
                                               (SRC) == ATIM_TRIGGER_SOURCE_ITR ||  \
                                               (SRC) == ATIM_TRIGGER_SOURCE_CH1A || \
                                               (SRC) == ATIM_TRIGGER_SOURCE_IAFP || \
                                               (SRC) == ATIM_TRIGGER_SOURCE_IBFP)

#define ATIM_UPDATE_EVENT_NORMAL               0x01  // 上溢出/下溢出
#define ATIM_UPDATE_EVENT_EXTENSION            0x00  // 上溢出/下溢出/软件更新/从模式复位
#define IS_ATIM_UPDATE_EVENT(EVENT)            ((EVENT) == ATIM_UPDATE_EVENT_NORMAL || \
                                               (EVENT) == ATIM_UPDATE_EVENT_EXTENSION)
                                               
