hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/Libraries/inc/cw32l010_atim.h
#define ATIM_TI_REMAP_ATIM_CHx                 0UL
#define ATIM_TI_REMAP_VC1_OUT                  1UL
#define ATIM_TI_REMAP_VC2_OUT                  2UL
#define ATIM_TI_REMAP_MCO_OUT                  5UL
#define ATIM_TI_REMAP_LSE_FAULT                7UL
#define ATIM_TI_REMAP_RTC_OUT                  8UL
#define ATIM_TI_REMAP_LSI_OUT                  9UL
#define ATIM_TI_REMAP_BTIM1_TRGO               10UL
#define ATIM_TI_REMAP_BTIM2_TRGO               11UL
#define ATIM_TI_REMAP_BTIM3_TRGO               12UL
#define ATIM_TI_REMAP_GTIM1_TRGO               13UL
#define ATIM_TI_REMAP_GTIM2_TRGO               14UL

#define ATIM_CH1                               0UL
#define ATIM_CH2                               1UL
#define ATIM_CH3                               2UL
#define ATIM_CH4                               3UL
#define ATIM_CH5                               4UL
#define ATIM_CH6                               5UL






/******************************************************************************
* Global variable definitions (declared in header file with 'extern')
******************************************************************************/

/******************************************************************************
* Global function prototypes
******************************************************************************/
void ATIM_DeInit(void);

void ATIM_Init(ATIM_InitTypeDef *ATIM_InitStruct);
void ATIM_Cmd(FunctionalState NewState);

void ATIM_ITConfig(uint32_t ATIM_IT, FunctionalState NewState);
ITStatus ATIM_GetITStatus(uint32_t ATIM_IT);
void ATIM_ClearITPendingBit(uint32_t ATIM_IT);

void ATIM_SetReloadValue(uint32_t Value);
void ATIM_SetCounterValue(uint32_t value);

void ATIM_MasterModeTrgo1Config(uint8_t ATIM_MasterOutput);
void ATIM_MasterModeTrgo2Config(uint8_t ATIM_MasterOutput);

void ATIM_SlaverModeConfig(uint8_t ATIM_SlaverType);
void ATIM_SetTriggerInput(uint32_t TriggerInput);

void ATIM_IC1Init(ATIM_ICInitTypeDef *TIM_ICInitStruct);
void ATIM_IC2Init(ATIM_ICInitTypeDef *TIM_ICInitStruct);
void ATIM_IC3Init(ATIM_ICInitTypeDef *TIM_ICInitStruct);
void ATIM_IC4Init(ATIM_ICInitTypeDef *TIM_ICInitStruct);
void ATIM_IC5Init(ATIM_ICInitTypeDef *TIM_ICInitStruct);
void ATIM_IC6Init(ATIM_ICInitTypeDef *TIM_ICInitStruct);

void ATIM_OC1Init(ATIM_OCInitTypeDef *TIM_OCInitStruct);
void ATIM_OC2Init(ATIM_OCInitTypeDef *TIM_OCInitStruct);
void ATIM_OC3Init(ATIM_OCInitTypeDef *TIM_OCInitStruct);
void ATIM_OC4Init(ATIM_OCInitTypeDef *TIM_OCInitStruct);
void ATIM_OC5Init(ATIM_OCInitTypeDef *TIM_OCInitStruct);
void ATIM_OC6Init(ATIM_OCInitTypeDef *TIM_OCInitStruct);

void ATIM_CH1Config(FunctionalState NewState);
void ATIM_CH2Config(FunctionalState NewState);
void ATIM_CH3Config(FunctionalState NewState);
void ATIM_CH4Config(FunctionalState NewState);
void ATIM_CH5Config(FunctionalState NewState);
void ATIM_CH6Config(FunctionalState NewState);

uint16_t ATIM_GetCapture1(void);
uint16_t ATIM_GetCapture2(void);
uint16_t ATIM_GetCapture3(void);
uint16_t ATIM_GetCapture4(void);
uint16_t ATIM_GetCapture5(void);
uint16_t ATIM_GetCapture6(void);

void ATIM_SetCompare1(uint16_t Compare);
void ATIM_SetCompare2(uint16_t Compare);
void ATIM_SetCompare3(uint16_t Compare);
void ATIM_SetCompare4(uint16_t Compare);
void ATIM_SetCompare5(uint16_t Compare);
void ATIM_SetCompare6(uint16_t Compare);

void ATIM_CtrlPWMOutputs(FunctionalState NewState);
void ATIM_SetPWMDeadtime(int16_t RiseDeadtime, int16_t FallDeadtime, FunctionalState BuffState);
void ATIM_Brake1Config(uint32_t ATIM_BrakePolarity, uint32_t ATIM_BrakeFilter);
void ATIM_Brake2Config(uint32_t ATIM_BrakePolarity, uint32_t ATIM_BrakeFilter);

void ATIM_UpdateEventSelect(uint8_t ATIM_UpdateEvent);

void ATIM_RemapTimerInput(uint32_t ChannelX, uint32_t Remap);

#ifdef __cplusplus
}
#endif

#endif /*__CW32L010_ATIM_H */
/**
  * @}
  */
